
import os
import glob as gl
from matplotlib import font_manager as fm
from matplotlib import pyplot as plt
from pathlib import Path


# -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
# 내보낼 모듈 임포트
# -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
from . import my_qtcheck                # 데이터 품질 점검 관련 함수 모듈
from . import my_plot                   # 시각화 관련 함수 모듈
from . import my_stats                  # 통계 분석 관련 함수 모듈
from . import my_prep                   # 데이터 전처리 관련 함수 모듈
from . import my_ols                    # 선형회귀 관련 함수 모듈


# -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
# 한글 폰트 설정
# -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
fpath = "./helpers/fonts"                           # 한글을 지원하는 폰트 파일의 경로
font_files = gl.glob(os.path.join(fpath, "*.ttf"))  # 폰트 파일 검색

for f in font_files:
    fm.fontManager.addfont(f)                       # 폰트 등록
    fprop = fm.FontProperties(fname=f)              # 폰트의 속성을 읽어옴
    fname = fprop.get_name()                        # 읽어온 속성에서 폰트 이름 추출
    plt.rcParams['font.family'] = fname   
